app/controllers/movies_controller.rb

  def search_by_director
    # Retrieve the move by ID
    @movie = Movie.find(params[:id])

    # Check if the movie has a director
    if @movie.director.blank?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ? AND ("movies"."id" != ?)  [["director", "George Lucas"], ["id", 1]]